RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_sfr.h
/******************************************************************************
*  Filename:       hw_rfcore_sfr.h
*  Revised:        $Date: 2013-04-12 15:10:54 +0200 (Fri, 12 Apr 2013) $
*  Revision:       $Revision: 9735 $
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_RFCORE_SFR_H__
#define __HW_RFCORE_SFR_H__

//*****************************************************************************
//
// The following are defines for the RFCORE_SFR register offsets.
//
//*****************************************************************************
#define RFCORE_SFR_MTCSPCFG     0x40088800  // MAC Timer event configuration 
#define RFCORE_SFR_MTCTRL       0x40088804  // MAC Timer control register 
#define RFCORE_SFR_MTIRQM       0x40088808  // MAC Timer interrupt mask 
#define RFCORE_SFR_MTIRQF       0x4008880C  // MAC Timer interrupt flags 
#define RFCORE_SFR_MTMSEL       0x40088810  // MAC Timer multiplex select 
#define RFCORE_SFR_MTM0         0x40088814  // MAC Timer multiplexed register 
                                            // 0 
#define RFCORE_SFR_MTM1         0x40088818  // MAC Timer multiplexed register 
                                            // 1 
#define RFCORE_SFR_MTMOVF2      0x4008881C  // MAC Timer multiplexed overflow 
                                            // register 2 
#define RFCORE_SFR_MTMOVF1      0x40088820  // MAC Timer multiplexed overflow 
                                            // register 1 
#define RFCORE_SFR_MTMOVF0      0x40088824  // MAC Timer multiplexed overflow 
                                            // register 0 
#define RFCORE_SFR_RFDATA       0x40088828  // The TX FIFO and RX FIFO may be 
                                            // accessed through this register. 
                                            // Data is written to the TX FIFO 
                                            // when writing to the RFD 
                                            // register. Data is read from the 
                                            // RX FIFO when the RFD register is 
                                            // read. The XREG registers 
                                            // RXFIFOCNT and TXFIFOCNT provide 
                                            // information on the amount of 
                                            // data in the FIFOs. The FIFO 
                                            // contents can be cleared by 
                                            // issuing SFLUSHRX and SFLUSHTX. 
#define RFCORE_SFR_RFERRF       0x4008882C  // RF error interrupt flags 
#define RFCORE_SFR_RFIRQF1      0x40088830  // RF interrupt flags 
#define RFCORE_SFR_RFIRQF0      0x40088834  // RF interrupt flags 
#define RFCORE_SFR_RFST         0x40088838  // RF CSMA-CA/strobe processor 


//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTCSPCFG register.
//
//*****************************************************************************
#define RFCORE_SFR_MTCSPCFG_MACTIMER_EVENMT_CFG_M \
                                0x00000070  // Selects the event that triggers 
                                            // an MT_EVENT2 pulse 000: 
                                            // MT_per_event 001: MT_cmp1_event 
                                            // 010: MT_cmp2_event 011: 
                                            // MTovf_per_event 100: 
                                            // MTovf_cmp1_event 101: 
                                            // MTovf_cmp2_event 110: Reserved 
                                            // 111: No event 

#define RFCORE_SFR_MTCSPCFG_MACTIMER_EVENMT_CFG_S 4
#define RFCORE_SFR_MTCSPCFG_MACTIMER_EVENT1_CFG_M \
                                0x00000007  // Selects the event that triggers 
                                            // an MT_EVENT1 pulse 000: 
                                            // MT_per_event 001: MT_cmp1_event 
                                            // 010: MT_cmp2_event 011: 
                                            // MTovf_per_event 100: 
                                            // MTovf_cmp1_event 101: 
                                            // MTovf_cmp2_event 110: Reserved 
                                            // 111: No event 

#define RFCORE_SFR_MTCSPCFG_MACTIMER_EVENT1_CFG_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTCTRL register.
//
//*****************************************************************************
#define RFCORE_SFR_MTCTRL_LATCH_MODE \
                                0x00000008  // 0: Reading MTM0 with 
                                            // MTMSEL.MTMSEL = 000 latches the 
                                            // high byte of the timer, making 
                                            // it ready to be read from MTM1. 
                                            // Reading MTMOVF0 with 
                                            // MTMSEL.MTMOVFSEL = 000 latches 
                                            // the two most-significant bytes 
                                            // of the overflow counter, making 
                                            // it possible to read these from 
                                            // MTMOVF1 and MTMOVF2. 1: Reading 
                                            // MTM0 with MTMSEL.MTMSEL = 000 
                                            // latches the high byte of the 
                                            // timer and the entire overflow 
                                            // counter at once, making it 
                                            // possible to read the values from 
                                            // MTM1, MTMOVF0, MTMOVF1, and 
                                            // MTMOVF2. 

#define RFCORE_SFR_MTCTRL_LATCH_MODE_M \
                                0x00000008
#define RFCORE_SFR_MTCTRL_LATCH_MODE_S 3
#define RFCORE_SFR_MTCTRL_STATE 0x00000004  // State of MAC Timer 0: Timer 
                                            // idle 1: Timer running 
#define RFCORE_SFR_MTCTRL_STATE_M \
                                0x00000004
#define RFCORE_SFR_MTCTRL_STATE_S 2
#define RFCORE_SFR_MTCTRL_SYNC  0x00000002  // 0: Starting and stopping of 
                                            // timer is immediate; that is, 
                                            // synchronous with clk_rf_32m. 1: 
                                            // Starting and stopping of timer 
                                            // occurs at the first positive 
                                            // edge of the 32-kHz clock. For 
                                            // more details regarding timer 
                                            // start and stop, see Section 
                                            // 22.4. 
#define RFCORE_SFR_MTCTRL_SYNC_M \
                                0x00000002
#define RFCORE_SFR_MTCTRL_SYNC_S 1
#define RFCORE_SFR_MTCTRL_RUN   0x00000001  // Write 1 to start timer, write 0 
                                            // to stop timer. When read, it 
                                            // returns the last written value. 
#define RFCORE_SFR_MTCTRL_RUN_M 0x00000001
#define RFCORE_SFR_MTCTRL_RUN_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTIRQM register.
//
//*****************************************************************************
#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_COMPARE2M \
                                0x00000020  // Enables the 
                                            // MACTIMER_OVF_COMPARE2 interrupt 

#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_COMPARE2M_M \
                                0x00000020
#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_COMPARE2M_S 5
#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_COMPARE1M \
                                0x00000010  // Enables the 
                                            // MACTIMER_OVF_COMPARE1 interrupt 

#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_COMPARE1M_M \
                                0x00000010
#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_COMPARE1M_S 4
#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_PERM \
                                0x00000008  // Enables the MACTIMER_OVF_PER 
                                            // interrupt 

#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_PERM_M \
                                0x00000008
#define RFCORE_SFR_MTIRQM_MACTIMER_OVF_PERM_S 3
#define RFCORE_SFR_MTIRQM_MACTIMER_COMPARE2M \
                                0x00000004  // Enables the MACTIMER_COMPARE2 
                                            // interrupt 

#define RFCORE_SFR_MTIRQM_MACTIMER_COMPARE2M_M \
                                0x00000004
#define RFCORE_SFR_MTIRQM_MACTIMER_COMPARE2M_S 2
#define RFCORE_SFR_MTIRQM_MACTIMER_COMPARE1M \
                                0x00000002  // Enables the MACTIMER_COMPARE1 
                                            // interrupt 

#define RFCORE_SFR_MTIRQM_MACTIMER_COMPARE1M_M \
                                0x00000002
#define RFCORE_SFR_MTIRQM_MACTIMER_COMPARE1M_S 1
#define RFCORE_SFR_MTIRQM_MACTIMER_PERM \
                                0x00000001  // Enables the MACTIMER_PER 
                                            // interrupt 

#define RFCORE_SFR_MTIRQM_MACTIMER_PERM_M \
                                0x00000001
#define RFCORE_SFR_MTIRQM_MACTIMER_PERM_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTIRQF register.
//
//*****************************************************************************
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_COMPARE2F \
                                0x00000020  // Set when the MAC Timer overflow 
                                            // counter counts to the value set 
                                            // at MTovf_cmp2 

#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_COMPARE2F_M \
                                0x00000020
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_COMPARE2F_S 5
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_COMPARE1F \
                                0x00000010  // Set when the MAC Timer overflow 
                                            // counter counts to the value set 
                                            // at Timer 2 MTovf_cmp1 

#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_COMPARE1F_M \
                                0x00000010
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_COMPARE1F_S 4
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_PERF \
                                0x00000008  // Set when the MAC Timer overflow 
                                            // counter would have counted to a 
                                            // value equal to MTovf_per, but 
                                            // instead wraps to 0 

