RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_rfcore_sfr.h
#define RFCORE_SFR_RFERRF_STROBEERR_M \
                                0x00000040
#define RFCORE_SFR_RFERRF_STROBEERR_S 6
#define RFCORE_SFR_RFERRF_TXUNDERF \
                                0x00000020  // TX FIFO underflowed. 0: No 
                                            // interrupt pending 1: Interrupt 
                                            // pending 

#define RFCORE_SFR_RFERRF_TXUNDERF_M \
                                0x00000020
#define RFCORE_SFR_RFERRF_TXUNDERF_S 5
#define RFCORE_SFR_RFERRF_TXOVERF \
                                0x00000010  // TX FIFO overflowed. 0: No 
                                            // interrupt pending 1: Interrupt 
                                            // pending 

#define RFCORE_SFR_RFERRF_TXOVERF_M \
                                0x00000010
#define RFCORE_SFR_RFERRF_TXOVERF_S 4
#define RFCORE_SFR_RFERRF_RXUNDERF \
                                0x00000008  // RX FIFO underflowed. 0: No 
                                            // interrupt pending 1: Interrupt 
                                            // pending 

#define RFCORE_SFR_RFERRF_RXUNDERF_M \
                                0x00000008
#define RFCORE_SFR_RFERRF_RXUNDERF_S 3
#define RFCORE_SFR_RFERRF_RXOVERF \
                                0x00000004  // RX FIFO overflowed. 0: No 
                                            // interrupt pending 1: Interrupt 
                                            // pending 

#define RFCORE_SFR_RFERRF_RXOVERF_M \
                                0x00000004
#define RFCORE_SFR_RFERRF_RXOVERF_S 2
#define RFCORE_SFR_RFERRF_RXABO 0x00000002  // Reception of a frame was 
                                            // aborted. 0: No interrupt pending 
                                            // 1: Interrupt pending 
#define RFCORE_SFR_RFERRF_RXABO_M \
                                0x00000002
#define RFCORE_SFR_RFERRF_RXABO_S 1
#define RFCORE_SFR_RFERRF_NLOCK 0x00000001  // The frequency synthesizer 
                                            // failed to achieve lock after 
                                            // time-out, or lock is lost during 
                                            // reception. The receiver must be 
                                            // restarted to clear this error 
                                            // situation. 0: No interrupt 
                                            // pending 1: Interrupt pending 
#define RFCORE_SFR_RFERRF_NLOCK_M \
                                0x00000001
#define RFCORE_SFR_RFERRF_NLOCK_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_RFIRQF1 register.
//
//*****************************************************************************
#define RFCORE_SFR_RFIRQF1_CSP_WAIT \
                                0x00000020  // Execution continued after a 
                                            // wait instruction in CSP. 0: No 
                                            // interrupt pending 1: Interrupt 
                                            // pending 

#define RFCORE_SFR_RFIRQF1_CSP_WAIT_M \
                                0x00000020
#define RFCORE_SFR_RFIRQF1_CSP_WAIT_S 5
#define RFCORE_SFR_RFIRQF1_CSP_STOP \
                                0x00000010  // CSP has stopped program 
                                            // execution. 0: No interrupt 
                                            // pending 1: Interrupt pending 

#define RFCORE_SFR_RFIRQF1_CSP_STOP_M \
                                0x00000010
#define RFCORE_SFR_RFIRQF1_CSP_STOP_S 4
#define RFCORE_SFR_RFIRQF1_CSP_MANINT \
                                0x00000008  // Manual interrupt generated from 
                                            // CSP 0: No interrupt pending 1: 
                                            // Interrupt pending 

#define RFCORE_SFR_RFIRQF1_CSP_MANINT_M \
                                0x00000008
#define RFCORE_SFR_RFIRQF1_CSP_MANINT_S 3
#define RFCORE_SFR_RFIRQF1_RFIDLE \
                                0x00000004  // Radio state-machine has entered 
                                            // the IDLE state. 0: No interrupt 
                                            // pending 1: Interrupt pending 

#define RFCORE_SFR_RFIRQF1_RFIDLE_M \
                                0x00000004
#define RFCORE_SFR_RFIRQF1_RFIDLE_S 2
#define RFCORE_SFR_RFIRQF1_TXDONE \
                                0x00000002  // A complete frame has been 
                                            // transmitted. 0: No interrupt 
                                            // pending 1: Interrupt pending 

#define RFCORE_SFR_RFIRQF1_TXDONE_M \
                                0x00000002
#define RFCORE_SFR_RFIRQF1_TXDONE_S 1
#define RFCORE_SFR_RFIRQF1_TXACKDONE \
                                0x00000001  // An acknowledgement frame has 
                                            // been completely transmitted. 0: 
                                            // No interrupt pending 1: 
                                            // Interrupt pending 

#define RFCORE_SFR_RFIRQF1_TXACKDONE_M \
                                0x00000001
#define RFCORE_SFR_RFIRQF1_TXACKDONE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_RFIRQF0 register.
//
//*****************************************************************************
#define RFCORE_SFR_RFIRQF0_RXMASKZERO \
                                0x00000080  // The RXENABLE register has gone 
                                            // from a nonzero state to an 
                                            // all-zero state. 0: No interrupt 
                                            // pending 1: Interrupt pending 

#define RFCORE_SFR_RFIRQF0_RXMASKZERO_M \
                                0x00000080
#define RFCORE_SFR_RFIRQF0_RXMASKZERO_S 7
#define RFCORE_SFR_RFIRQF0_RXPKTDONE \
                                0x00000040  // A complete frame has been 
                                            // received. 0: No interrupt 
                                            // pending 1: Interrupt pending 

